### 조건문

In [ ]:
# 국어 85점 이상, 영어 85점 이상 / 2가지 조건 and: & && or: | ||
# / 이름,학교,국어,영어 출력
(df['국어'] >= 85) & (df['영어'] >= 85)
df.loc[(df['국어'] >= 85) & (df['영어'] >= 85),['이름','학교','국어','영어']]

#85점 이하 ~ 조건의 반대
df.loc[~(df['국어'] >= 85) & ~(df['영어'] >= 85),['이름','학교','국어','영어']]

### 축 변경

In [ ]:
df=df.T # row, colums 축 변경

### 인덱스 이름 변경

In [ ]:
# 인덱스 이름 변경하기 df.rename(index={'':''},inplace=True)

### 데이터 확인

In [1]:
import pandas as pd
df = pd.read_excel('score.xlsx',index_col='지원번호')
df
df.describe()   # 컬럼별 대략적 정보, 최대,최소,평균 등등
df.head(10)     #  () 5개, 너무많아, 10개만 보고싶다.
df.tail(10)     # () 5개, 아래 10개
df.info()   # 컬럼별 타입, 크기정보
df.values   # rows 데이터 배열로 출력
df.index    # index 정보
df.columns  # 컬럼 정보
df.shape    # 데이터 크기 정보

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, 1번 to 8번
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      8 non-null      object
 1   학교      8 non-null      object
 2   키       8 non-null      int64
 3   국어      8 non-null      int64
 4   영어      8 non-null      int64
 5   수학      8 non-null      int64
 6   과학      8 non-null      int64
 7   사회      8 non-null      int64
 8   sw특기    6 non-null      object
dtypes: int64(6), object(3)
memory usage: 640.0+ bytes

(8, 9)

### 파일 불러오기 / 오름차순 정렬 / 저장하기

In [2]:
import pandas as pd
df = pd.read_excel('score.xlsx',index_col='지원번호')
df.sort_index(inplace=True) # 오름차순 정렬
df.to_excel('score.xlsx')
df

       이름   학교    키   국어   영어   수학  과학  사회        sw특기
지원번호
1번    강나래  구로고  197   90   85  100  95  85      Python
2번    강태원  구로고  184   40   35   50  55  25        Java
3번    강호림  구로고  168   80   75   70  80  75  Javascript
4번    김수찬  구로고  187   40   60   70  75  80         NaN
5번    김재욱  구로고  188   15   20   10  35  10         NaN
6번    박동현  단지고  202   80  100   95  85  85          C+
7번    박혜정  단지고  188   55   65   45  40  35      PYTHON
8번    송근열  단지고  190  100   85   90  94  95          c#

### 컬럼 1개, 2개이상 불러오기

In [3]:
df['키']
df['이름']
df[['이름','키']]

       이름    키
지원번호
1번    강나래  197
2번    강태원  184
3번    강호림  168
4번    김수찬  187
5번    김재욱  188
6번    박동현  202
7번    박혜정  188
8번    송근열  190

In [4]:
df['키'].max()

202

In [5]:
df['키'].mean() # 평균

188.0

In [6]:
df['키']>df['키'].mean() # 키가 평균보다 큰사람은 True,

지원번호
1번     True
2번    False
3번    False
4번    False
5번    False
6번     True
7번    False
8번     True
Name: 키, dtype: bool

In [7]:
df['키'].min()

168

In [9]:
df['키'].nlargest(4) # 키 큰순으로 4개 가져옴
df['키'].nsmallest(4) # 키 작은순으로 4개 가져옴

지원번호
3번    168
2번    184
4번    187
5번    188
Name: 키, dtype: int64

In [3]:
df['키'].max()  # 최대
df['키'].min()  # 최소
df['키'].mean() #평균
df['키'].count()    # 갯수
df['키'].describe()    # count, mean, std, min, max 정보

count      8.000000
mean     188.000000
std        9.985704
min      168.000000
25%      186.250000
50%      188.000000
75%      191.750000
max      202.000000
Name: 키, dtype: float64

In [4]:
df

       이름   학교    키   국어   영어   수학  과학  사회        sw특기
지원번호
1번    강나래  구로고  197   90   85  100  95  85      Python
2번    강태원  구로고  184   40   35   50  55  25        Java
3번    강호림  구로고  168   80   75   70  80  75  Javascript
4번    김수찬  구로고  187   40   60   70  75  80         NaN
5번    김재욱  구로고  188   15   20   10  35  10         NaN
6번    박동현  단지고  202   80  100   95  85  85          C+
7번    박혜정  단지고  188   55   65   45  40  35      PYTHON
8번    송근열  단지고  190  100   85   90  94  95          c#

In [6]:
df['학교'].unique() # 중복제거, array(['구로고', '단지고'], dtype=object)
df['학교'].nunique() # 중복제거 후 갯수 출력, 2

2

In [2]:
import pandas as pd
df = pd.read_csv('students.csv',index_col='no')
df

         name  kor  eng  math  total        avg
no
1       Cammi   62   70    81    213  71.000000
2      Rafael   90   62    79    231  77.000000
3    Papageno   64   73    50    187  62.333333
4      Celine   76   54    83    213  71.000000
5      Stacee   51   55    72    178  59.333333
..        ...  ...  ...   ...    ...        ...
96     Karena   97   89    92    278  92.666667
97      Tedie   96   99    58    253  84.333333
98     Gordon   96   53    83    232  77.333333
99      Xenia  100   61    55    216  72.000000
100    Cesaro   72   59    77    208  69.333333

[100 rows x 6 columns]